#L = int(input("впишіть сантиметри: "))

#print("цілих метрів у l:",L//100)

#a = int(input("впишіть довжину відрізка а:"))
#b = int(input("впишіть довжину відрізка b:"))

#print("ціла кількість відрізку а та б=",a//b)

#a = int(input("впишіть трьохзначне число: "))
#b = a//100
#c = (a//10)%10
#d = a%10
#g = b+c+d
#h = b*c*d
#print(g,h)

#n = int(input("введіть кількість секунд:"))
#a = n//3600
#print(a)

#a = int(input("напишіть байти:"))
#b = a//1024
#print("кілобайт =",b)

a = int(input("впишіть трьохзначне число: "))
b = a//100
c = (a//10)%10
d = a%10
f = d*100+c*10+b
print(f)