#a = int(input("Ведіть сторону квадрата а "))

#print("периметр квадрата зі стороною а:", a*4)

#d = int(input("введіть діаметр кола "))

#print("Довжина кола:", d*3.14)

#a = int(input("Введіть сторону а "))
#b = int(input("Введіть сторону b "))
#c = int(input("Введіть сторону c "))
#V = a*b*c
#S = 2*(a*b+b*c+a*c)
#print("Обєм =",V,"площа поверхні =",S)

#a = int(input("введіть а "))
#b = int(input("введіть б "))

#print("середнє арифматичне число =",(a+b)/2)

#a = int(input("введіть 1 число: "))
#b = int(input("введіть 2 число: "))

#print("сумма квадратів =",a**2+b**2)
#print("Різниця квадрітів=",a**2-b**2)
#print("добуток квадратів=",a**2*b**2)
#print("частка квадратів=",a**2/b**2)

x = int(input("введіть число x "))
y = 3*x**6-6*x**2-7
print(y)